Revit 2027 API
ElementArray Class
An array that contains element objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ElementArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementArray : APIObject,
	IEnumerable
Public Class ElementArray
	Inherits APIObject
	Implements IEnumerable
public ref class ElementArray : public APIObject,
	IEnumerable
type ElementArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ElementArray type exposes the following members.
Constructors
Name | Description
ElementArray | Initializes a new instance of the ElementArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Item | Gets or sets an element at a specified index within the array.
Size | Returns the number of elements that are in the array.
Top
Methods
Name | Description
Append | Add the element to the end of the array.
Clear | Removes every element from the array, rendering it empty.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified element into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace